const zalupa = [
  [-5.59, -1.73],    [1.79,  1.03],   [-1.09, -2.00],   [-0.47, -0.89],  [-1.54, -2.92 ], 
  [-1.01, -2.71],   [-2.83, -3.85],   [-8.24, -6.69],   [-0.51, -1.24],   [-3.36, -4.57], 
  [-4.36, -0.96],  [-0.51, -2.57],   [-0.49, -4.59],   [-2.78, -4.30],  [-1.31, -2.55],  
  [1.66,  2.28],    [2.67,  0.56],   [-5.24, -2.89],   [-3.23, -5.92],   [-0.12, -1.81],  
  [1.78, -0.30],   [-3.34, -4.04],    [2.40,  3.71],   [-0.13, -1.95],   [-1.13, -1.24],  
  [-3.01, -1.35],    [1.37, -1.98],   [-0.74, -2.10],    [3.62,  0.08],   [-4.52, -4.51],  
  [-2.65, -1.54],   [-1.18,  0.47],  [-0.86, -0.18],   [-2.23, -0.34],   [-3.82,  0.65],  
  [-1.61, -1.70],   [1.32,  0.95],    [0.99, -2.07],   [-3.38, -2.96],   [-2.28, -3.02],
  [-0.82, -2.32],   [-2.32, -1.88],   [-0.73, -3.41],   [-2.44,  0.82],  [-3.25, -4.58], 
  [-3.22, -1.41],    [0.63, -1.03],   [-2.25, -1.88],   [-1.83,  0.30],    [0.58, -0.34]
]

let sumx = 0;
let sumy = 0;

let sumx2 = 0;
let sumy2 = 0;

let sumxy = 0;

for (let i = 0; i < zalupa.length; i++) {
  sumx = sumx + zalupa[i][0];
  //console.log(zalupa[i][0] * zalupa[i][0]); // x^2
  sumy = sumy + zalupa[i][1];
  //console.log(zalupa[i][1] * zalupa[i][1]); // y^2
  //console.log(zalupa[i][0] * zalupa[i][1]); // xy

  sumx2 = sumx2 + (zalupa[i][0] * zalupa[i][0]);
  sumy2 = sumy2 + (zalupa[i][1] * zalupa[i][1]);

  sumxy = sumxy + (zalupa[i][0] * zalupa[i][1]);
}

console.log(sumx);
console.log(sumy);

//console.log(sumx / 50); // мат ожидание х (среднее арифм всех х)
//console.log(sumy / 50); // мат ожидание у

//console.log(sumx2 / 50); // оц нач момента х (среднее арифм всех х^2)
//console.log(sumy2 / 50); // оц нач момента у

//console.log(sumxy / 50); // оц смеш нач момента (среднее арифм всех хy)

let dx = ((1 / 49) * sumx2) - ((50 / 49) * (sumx / 50) * (sumx / 50));
let dy = ((1 / 49) * sumy2) - ((50 / 49) * (sumy / 50) * (sumy / 50));
let km = ((1 / 49) * sumxy) - ((50 / 49) * (sumx / 50) * (sumy / 50));

console.log(dx); // Дисперсия по х
console.log(dy); // Дисперсия по y
console.log(km); // Оценка корреляционного момента
console.log(km / Math.sqrt(dx * dy)); // Точечная оценка коэфф корреляции
